# CreateRenderworksStyle

```pascal
FUNCTION CreateRenderworksStyle : HANDLE;
```

```python
def vs.CreateRenderworksStyle():
    return HANDLE
```

## Examples
```pascal
resultH := CreateRenderworksStyle;
```
```python
import vs

objHandle = vs.CreateRenderworksStyle()
if objHandle is not None:
    vs.Message('Created object handle: ' + str(objHandle))
```

## Version
Availability: from Vectorworks 2012

## Category
* View @ Zoom